      *--------------------------------------------------------------*      * FILE ID       : OTHER-SYSTEM LINK FCD                        *      *               : PROGRAM FCDBL111                             *      * RECORD LENGTH : 1200 BYTES                                   *      *--------------------------------------------------------------*       01  FCDL111-RECORD.           05  FCDL111-INPUT.               10  FCD1-I-CHANNEL         PIC  X(03).               10  FCD1-I-TELLER-ID.                   15  FCD1-I-TELLER-1    PIC  X(04).                   15  FCD1-I-TELLER-2    PIC  X(04).               10  FCD1-I-TERMINAL        PIC  X(08).               10  FCD1-I-DATE            PIC  9(08).               10  FCD1-I-TIME            PIC  9(06).               10  FCD1-I-FR-BRANCH       PIC  9(05)    COMP-3.               10  FCD1-I-ACCT-NO         PIC  9(11)    COMP-3.               10  FCD1-I-AMOUNT          PIC S9(13)V99 COMP-3.               10  FCD1-I-FCY-CODE        PIC  X(03).               10  FCD1-I-CARD-NO         PIC  X(16).               10  FCD1-I-TRAN-CODE       PIC  9(04).               10  FCD1-I-FR-BANK         PIC  9(03)  COMP-3.               10  FCD1-I-TO-BANK         PIC  9(03)  COMP-3.               10  FCD1-I-TR-ACCT         PIC  9(11)  COMP-3.               10  FCD1-I-TR-OWN-FLAG     PIC  X(01).               10  FCD1-I-FCD-SEQ-LOG     PIC  9(07)  COMP-3.               10  FCD1-I-EXCH-RATE       PIC  9(03)V9(08) COMP-3.               10  FCD1-I-EXCH-RATE-CROSS PIC  9(03)V9(08) COMP-3.               10  FCD1-I-MENU-NO         PIC  X(01).               10  FCD1-I-PURPOSE         PIC  X(06).               10  FCD1-I-SWF-BANK-TYPE   PIC  X(01).               10  FCD1-I-FIXED-TERM      PIC  9(03).               10  FCD1-I-FIXED-MONTH     PIC  X(01).               10  FCD1-I-INTER-REGION-FEE-THB   PIC  9(03)V99   COMP-3.               10  FCD1-I-COMMUNICATION-FEE-THB  PIC  9(03)V99   COMP-3.               10  FCD1-I-DMS-KEY         PIC  X(30).               10  FCD1-I-REMARK          PIC  X(40).               10  FILLER                 PIC  X(12).               10  FCD1-I-EXPAND-DATA     PIC  X(200).      *- 400 BYTES           05  FCDL111-OUTPUT.               10  FCD1-O-RETURN-CODE     PIC  X(02).               10  FCD1-O-RETURN-MSG      PIC  X(50).      *- CUSTOMER DETAIL               10  FCD1-O-ACCT-NAME       PIC  X(40).               10  FCD1-O-ACCT-TH-NAME.                   15  FCD1-O-ACCT-TITLE-TH   PIC  X(12).                   15  FCD1-O-ACCT-NAME-TH    PIC  X(35).                   15  FCD1-O-ACCT-SURNAME-TH PIC  X(35).               10  FCD1-O-ACCT-EN-NAME.                   15  FCD1-O-ACCT-TITLE-EN   PIC  X(12).                   15  FCD1-O-ACCT-NAME-EN    PIC  X(35).                   15  FCD1-O-ACCT-SURNAME-EN PIC  X(35).               10  FCD1-O-ADDRESS1        PIC  X(40).               10  FCD1-O-ADDRESS2        PIC  X(40).               10  FCD1-O-PROVINCE        PIC  9(03)  COMP-3.               10  FCD1-O-POST-CODE       PIC  9(05)  COMP-3.               10  FCD1-O-TEL-1           PIC  X(20).               10  FCD1-O-BUSINESS-TYPE   PIC  9(07)  COMP-3.               10  FCD1-O-BIRTH-DATE      PIC  9(09)  COMP-3.               10  FCD1-O-SEX             PIC  X(01).               10  FCD1-O-RESIDENT-FLAG   PIC  X(01).               10  FCD1-O-CARD-TYPE       PIC  9(03)  COMP-3.               10  FCD1-O-CARD-NO         PIC  X(20).               10  FCD1-O-CUST-TYPE       PIC  9(05)  COMP-3.               10  FCD1-O-OPEN-DATE       PIC  9(09)  COMP-3.               10  FCD1-O-PASSBOOK-NO     PIC  9(11)  COMP-3.               10  FCD1-O-FCY-CODE        PIC  X(03).               10  FCD1-O-ACCT-BR         PIC  9(05)       COMP-3.      *- TRANSACTION DETAIL               10  FCD1-O-FCY-BAL         PIC S9(13)V99    COMP-3.               10  FCD1-O-THB-BAL         PIC S9(13)V99    COMP-3.               10  FCD1-O-FCY-BAL-AVAI    PIC S9(13)V99    COMP-3.               10  FCD1-O-EXCH-RATE       PIC  9(03)V9(08) COMP-3.               10  FCD1-O-EXCH-RATE-CROSS PIC  9(03)V9(08) COMP-3.               10  FCD1-O-FCY-CROSS       PIC  X(03).               10  FCD1-O-ORG-AMT         PIC S9(13)V99    COMP-3.               10  FCD1-O-FEE-COMM-FCY    PIC  9(07)V99    COMP-3.               10  FCD1-O-FEE-COMM-THB    PIC  9(07)V99    COMP-3.               10  FCD1-O-FEE-ROAM-FCY    PIC  9(03)V99    COMP-3.               10  FCD1-O-FEE-ROAM-THB    PIC  9(03)V99    COMP-3.               10  FCD1-O-FEE-LINE-FCY    PIC  9(03)V99    COMP-3.               10  FCD1-O-FEE-LINE-THB    PIC  9(03)V99    COMP-3.               10  FCD1-O-SEQ-LOG         PIC  9(07)       COMP-3.               10  FCD1-O-FCD-TYPE        PIC  X(01).               10  FCD1-O-CIF-TYPE        PIC  X(01).               10  FCD1-O-CIF-NO          PIC  9(15)       COMP-3                                          OCCURS   4 TIMES.               10  FCD1-O-ACCT-TYPE       PIC  X(01).160725         10  FCD1-O-RETURN-CODE2    PIC  X(03).170615         10  FCD1-O-ACCT-STATUS     PIC  X(01).170615         10  FCD1-O-DR-CR-ALLOW     PIC  X(01).               10  FILLER                 PIC  X(73).               10  FCD1-O-EXPAND-DATA     PIC  X(200).